{
	"_id": "kUdHjEu3M9HmjXPM",
	"_key": "!items!kUdHjEu3M9HmjXPM",
	"effects": [
	],
	"folder": "cQCqYG2AB4usZmTB",
	"img": "systems/D35E/icons/spells/named-spells/magic-circle-against-evil.png",
	"name": "Magic Circle Against Evil",
	"system": {
		"activateActions": [
			{
				"action": "Create unique \"Magic Circle Against Evil\" from \"D35E.common-auras\" on self; Set aura \"Magic Circle Against Evil\" field data.level to max(1,(@cl)) on self; Activate aura \"Magic Circle Against Evil\" on self;",
				"condition": "",
				"img": "",
				"name": ""
			}
		],
		"activation": {
			"cost": 1,
			"type": ""
		},
		"active": false,
		"addedLevel": 0,
		"attackParts": [
		],
		"buffType": "temp",
		"changeFlags": {
			"firstChangeTargetSelectableOnDescription": false,
			"hasted": false,
			"heavyArmorFullSpeed": false,
			"improvedMultiattack": false,
			"loseDexToAC": false,
			"mediumArmorFullSpeed": false,
			"multiAttack": false,
			"multiweaponAttack": false,
			"noCon": false,
			"noDex": false,
			"noEncumbrance": false,
			"noInt": false,
			"noStr": false,
			"oneCha": false,
			"oneInt": false,
			"oneWis": false,
			"uncannyDodge": false
		},
		"changes": [
		],
		"classSource": "",
		"combatChangeCustomDisplayName": "",
		"combatChangeCustomReferenceName": "",
		"combatChanges": [
		],
		"combatChangesAdditionalRanges": {
			"hasAdditionalRanges": false,
			"slider1": {
				"max": 0,
				"maxFormula": "",
				"name": ""
			},
			"slider2": {
				"max": 0,
				"maxFormula": "",
				"name": ""
			},
			"slider3": {
				"max": 0,
				"maxFormula": "",
				"name": ""
			}
		},
		"combatChangesApplySpecialActionsOnce": true,
		"combatChangesRange": {
			"max": 0,
			"maxFormula": ""
		},
		"combatChangesUsesCost": "chargesPerUse",
		"conditionFlags": {
			"dazzled": false,
			"polymorphed": false,
			"wildshaped": false
		},
		"conditionals": [
		],
		"container": "None",
		"containerWeightless": false,
		"contextNotes": [
		],
		"counterName": "",
		"createdBy": "",
		"creationChanges": [
		],
		"customAttributes": {
		},
		"customAttributesLocked": false,
		"customTag": "",
		"damage": {
			"alternativeParts": [
			],
			"parts": [
			]
		},
		"damagePool": {
			"current": 0,
			"deleteOnDamagePoolEmpty": false,
			"enabled": false,
			"formula": "",
			"max": 0
		},
		"damageReduction": [
		],
		"deactivateActions": [
			{
				"action": "Remove aura \"Magic Circle Against Evil\" on self;",
				"condition": "",
				"img": "",
				"name": ""
			}
		],
		"description": {
			"chat": "",
			"unidentified": "",
			"value": "<p>All creatures within the area gain the effects of a protection from evil spell, and no nongood summoned creatures can enter the area either. You must overcome a creature&rsquo;s spell resistance in order to keep it at bay (as in the third function of protection from evil), but the deflection and resistance bonuses and the protection from mental control apply regardless of enemies&rsquo; spell resistance.</p>\n<p>This spell has an alternative version that you may choose when casting it. A magic circle against good can be focused inward rather than outward. When focused inward, the spell binds a nongood called creature (such as those called by the lesser planar binding, planar binding, and greater planar binding spells) for a maximum of 24 hours per caster level, provided that you cast the spell that calls the creature within 1 round of casting the magic circle. The creature cannot cross the circle&rsquo;s boundaries. If a creature too large to fit into the spell&rsquo;s area is the subject of the spell, the spell acts as a normal protection from evil spell for that creature only.</p>\n<p>A magic circle leaves much to be desired as a trap. If the circle of powdered silver laid down in the process of spellcasting is broken, the effect immediately ends. The trapped creature can do nothing that disturbs the circle, directly or indirectly, but other creatures can. If the called creature has spell resistance, it can test the trap once a day. If you fail to overcome its spell resistance, the creature breaks free, destroying the circle. A creature capable of any form of dimensional travel (astral projection, blink, dimension door, etherealness, gate, plane shift, shadow walk, teleport, and similar abilities) can simply leave the circle through that means. You can prevent the creature&rsquo;s extradimensional escape by casting a dimensional anchor spell on it, but you must cast the spell before the creature acts. If you are successful, the anchor effect lasts as long as the magic circle does. The creature cannot reach across the magic circle, but its ranged attacks (ranged weapons, spells, magical abilities, and the like) can. The creature can attack any target it can reach with its ranged attacks except for the circle itself.</p>\n<p>You can add a special diagram (a two-dimensional bounded figure with no gaps along its circumference, augmented with various magical sigils) to make the magic circle more secure. Drawing the diagram by hand takes 10 minutes and requires a DC 20 Spellcraft check. You do not know the result of this check. If the check fails, the diagram is ineffective. You can take 10 when drawing the diagram if you are under no particular time pressure to complete the task. This task also takes 10 full minutes. If time is no factor at all, and you devote 3 hours and 20 minutes to the task, you can take 20.</p>\n<p>A successful diagram allows you to cast a dimensional anchor spell on the magic circle during the round before casting any summoning spell. The anchor holds any called creatures in the magic circle for 24 hours per caster level. A creature cannot use its spell resistance against a magic circle prepared with a diagram, and none of its abilities or attacks can cross the diagram. If the creature tries a Charisma check to break free of the trap (see the lesser planar binding spell), the DC increases by 5. The creature is immediately released if anything disturbs the diagram&mdash;even a straw laid across it. However, the creature itself cannot disturb the diagram either directly or indirectly, as noted above.</p>\n<p>This spell is not cumulative with protection from evil and vice versa.</p>\n<p>Arcane Material Component: A little powdered silver with which you trace a 3-foot diameter circle on the floor (or ground) around the creature to be warded.</p>"
		},
		"duration": {
			"units": "",
			"value": null
		},
		"epic": "",
		"hideFromToken": true,
		"identifiedName": "Magic Circle Against Evil",
		"index": {
			"subType": null,
			"uniqueId": ""
		},
		"level": "",
		"light": {
			"alpha": 0.5,
			"animationIntensity": 6,
			"animationSpeed": 6,
			"color": "#000000",
			"dimRadius": null,
			"emitLight": false,
			"lightAngle": 360,
			"opacity": 0,
			"radius": 0,
			"type": ""
		},
		"linkId": "",
		"linkImported": false,
		"linkSourceId": "",
		"linkSourceName": "",
		"linkedChargeItem": {
			"id": null,
			"img": null,
			"name": null
		},
		"nameFormula": "",
		"nameFromFormula": false,
		"originId": "",
		"originPack": "",
		"originVersion": 18,
		"perRoundActions": [
		],
		"possibleUpdate": false,
		"psionic": "",
		"range": {
			"units": "",
			"value": null
		},
		"recharge": {
			"current": 0,
			"enabled": false,
			"formula": ""
		},
		"requirements": [
		],
		"requiresPsionicFocus": false,
		"resistances": [
		],
		"senses": {
			"blindsight": null,
			"darkvision": null,
			"lowLight": false,
			"lowLightMultiplier": null,
			"tremorsense": null,
			"truesight": null
		},
		"shapechange": {
			"source": {
			},
			"type": "polymorph"
		},
		"sizeOverride": "",
		"source": "",
		"specialActions": [
		],
		"summon": [
		],
		"tags": [
		],
		"target": {
			"value": ""
		},
		"timeline": {
			"deleteOnExpiry": true,
			"elapsed": 0,
			"enabled": true,
			"formula": "@item.level*100",
			"tickOnEnd": false,
			"total": 100
		},
		"uniqueId": "",
		"userNonRemovable": false,
		"uses": {
			"allowMultipleUses": false,
			"autoDeductCharges": true,
			"canBeLinked": false,
			"chargesPerUse": 1,
			"isResource": false,
			"max": 0,
			"maxFormula": "",
			"maxPerUse": null,
			"maxPerUseFormula": "",
			"per": null,
			"rechargeFormula": null,
			"value": 0
		}
	},
	"type": "buff"
}
