{
	"_id": "4rjyuBOPSmTjaiG2",
	"_key": "!journal!4rjyuBOPSmTjaiG2",
	"content": "<p class=\"p1\">A discipline is one of six groupings of powers, each defined by a common theme. The six disciplines are clairsentience, metacreativity, psychokinesis, psychometabolism, psychoportation, and telepathy.</p>\n<p class=\"p1\"><strong>Clairsentience:</strong>&nbsp;A psion who chooses clairsentience is known as a seer. Seers can learn precognitive powers to aid their comrades in combat, as well as powers that permit them to gather information in many different ways.</p>\n<p class=\"p1\"><strong>Metacreativity:</strong>&nbsp;A psion specializing in metacreativity is known as a shaper. This discipline includes powers that draw ectoplasm or matter from the Astral Plane, creating semisolid and solid items such as armor, weapons, or animated constructs to do battle at the shaper&rsquo;s command.</p>\n<p class=\"p1\"><strong>Psychokinesis:</strong>&nbsp;Psions who specialize in psychokinesis are known as kineticists. They are the masters of powers that manipulate and transform matter and energy. Kineticists can attack with devastating blasts of energy.</p>\n<p class=\"p1\"><strong>Psychometabolism:&nbsp;</strong>A psion who specializes in psychometabolism is known as an egoist. This discipline consists of powers that alter the psion&rsquo;s psychobiology, or that of creatures near him. An egoist can both heal and transform himself into a fearsome fighter.</p>\n<p class=\"p1\"><strong>Psychoportation:&nbsp;</strong>A psion who relies on psychoportation powers is known as a nomad. Nomads can wield powers that propel or displace objects in space or time.</p>\n<p class=\"p1\"><strong>Telepathy:</strong> A psion who chooses the discipline of telepathy is known as a telepath. He is the master of powers that allow mental contact and control of other sentient creatures. A telepath can deceive or destroy the minds of his enemies with ease.</p>",
	"folder": "",
	"name": "Psionic Disciplines",
	"pages": [
	],
	"permission": {
		"default": 0,
		"wbFPpmVfPG23MbMC": 3
	}
}
