{
	"_id": "TtCDZqtfB75FHqZp",
	"_key": "!journal!TtCDZqtfB75FHqZp",
	"content": "<p>Good&nbsp;clerics&nbsp;and&nbsp;paladins&nbsp;and some neutral clerics can channel positive energy, which can halt, drive off (rout), or destroy undead.</p>\n<p>Evil clerics and some neutral clerics can channel negative energy, which can halt, awe (rebuke), control (command), or bolster undead.</p>\n<p>Regardless of the effect, the general term for the activity is \"turning.\" When attempting to exercise their divine control over these creatures, characters make turning checks.</p>\n<table id=\"tableTurningUndead\" cellspacing=\"0\"><caption>Table: Turning Undead</caption>\n<tbody>\n<tr>\n<th>Turning Check<br />Result</th>\n<th>Most Powerful Undead Affected<br />(Maximum Hit Dice)</th>\n</tr>\n<tr>\n<td align=\"center\">0 or lower</td>\n<td align=\"center\">Cleric&rsquo;s level -4</td>\n</tr>\n<tr>\n<td align=\"center\">1&mdash;3</td>\n<td align=\"center\">Cleric&rsquo;s level -3</td>\n</tr>\n<tr>\n<td align=\"center\">4&mdash;6</td>\n<td align=\"center\">Cleric&rsquo;s level -2</td>\n</tr>\n<tr>\n<td align=\"center\">7&mdash;9</td>\n<td align=\"center\">Cleric&rsquo;s level -1</td>\n</tr>\n<tr>\n<td align=\"center\">10&mdash;12</td>\n<td align=\"center\">Cleric&rsquo;s level</td>\n</tr>\n<tr>\n<td align=\"center\">13&mdash;15</td>\n<td align=\"center\">Cleric&rsquo;s level +1</td>\n</tr>\n<tr>\n<td align=\"center\">16&mdash;18</td>\n<td align=\"center\">Cleric&rsquo;s level +2</td>\n</tr>\n<tr>\n<td align=\"center\">19&mdash;21</td>\n<td align=\"center\">Cleric&rsquo;s level +3</td>\n</tr>\n<tr>\n<td align=\"center\">22 or higher</td>\n<td align=\"center\">Cleric&rsquo;s level +4</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"turningChecks\">Turning Checks</h2>\n<p>Turning undead is a&nbsp;supernatural ability&nbsp;that a character can perform as a&nbsp;standard action. It does not provoke&nbsp;attacks of opportunity.</p>\n<p>You must present your holy symbol to turn undead. Turning is considered an attack.</p>\n<h3 id=\"timesperDay\">Times per Day</h3>\n<p>You may attempt to turn undead a number of times per day equal to 3 + your Charisma modifier. You can increase this number by taking the&nbsp;Extra Turning&nbsp;feat.</p>\n<h3 id=\"range\">Range</h3>\n<p>You turn the closest turnable undead first, and you can&rsquo;t turn undead that are more than 60 feet away or that have&nbsp;total cover&nbsp;relative to you. You don&rsquo;t need line of sight to a target, but you do need line of effect.</p>\n<h3 id=\"turningCheck\">Turning Check</h3>\n<p>The first thing you do is roll a turning check to see how powerful an&nbsp;undead&nbsp;creature you can turn. This is a Charisma check (1d20 + your Charisma modifier).&nbsp;Table: Turning Undead&nbsp;gives you the Hit Dice of the most powerful undead you can affect, relative to your level. On a given turning attempt, you can turn no undead creature whose Hit Dice exceed the result on this table.</p>\n<h3 id=\"turningDamage\">Turning Damage</h3>\n<p>If your roll on&nbsp;Table: Turning Undead&nbsp;is high enough to let you turn at least some of the undead within 60 feet, roll 2d6 + your&nbsp;cleric&nbsp;level + your Charisma modifier for turning damage. That&rsquo;s how many total Hit Dice of undead you can turn.</p>\n<p>If your Charisma score is average or low, it&rsquo;s possible to roll fewer Hit Dice of undead turned than indicated on&nbsp;Table: Turning Undead.</p>\n<p>You may skip over already&nbsp;turned&nbsp;undead that are still within range, so that you do not waste your turning capacity on them.</p>\n<h3 id=\"effectandDurationofTurning\">Effect and Duration of Turning</h3>\n<p>Turned undead flee from you by the best and fastest means available to them. They flee for 10 rounds (1 minute). If they cannot flee, they&nbsp;cower&nbsp;(giving any&nbsp;attack rolls&nbsp;against them a +2 bonus). If you approach within 10 feet of them, however, they overcome being turned and act normally. (You can stand within 10 feet without breaking the turning effect&mdash;you just can&rsquo;t approach them.) You can attack them with ranged attacks (from at least 10 feet away), and others can attack them in any fashion, without breaking the turning effect.</p>\n<h3 id=\"destroyingUndead\">Destroying Undead</h3>\n<p>If you have twice as many levels (or more) as the undead have Hit Dice, you destroy any that you would normally turn.</p>\n<h2 id=\"evilClericsandUndead\">Evil Clerics and Undead</h2>\n<p>Evil&nbsp;clerics&nbsp;channel negative energy to rebuke (awe) or command (control) undead rather than channeling positive energy to turn or destroy them. An evil cleric makes the equivalent of a turning check. Undead that would be turned are rebuked instead, and those that would be destroyed are commanded.</p>\n<h3 id=\"rebuked\">Rebuked</h3>\n<p>A rebuked&nbsp;undead&nbsp;creature cowers as if in awe (attack rolls&nbsp;against the creature get a +2 bonus). The effect lasts 10 rounds.</p>\n<h3 id=\"commanded\">Commanded</h3>\n<p>A commanded&nbsp;undead&nbsp;creature is under the mental control of the evil cleric. The cleric must take a&nbsp;standard action&nbsp;to give mental orders to a commanded undead. At any one time, the cleric may command any number of undead whose total Hit Dice do not exceed his level. He may voluntarily relinquish command on any commanded undead creature or creatures in order to command new ones.</p>\n<h3 id=\"dispellingTurning\">Dispelling Turning</h3>\n<p>An evil&nbsp;cleric&nbsp;may channel negative energy to dispel a good cleric&rsquo;s turning effect. The evil cleric makes a turning check as if attempting to rebuke the undead. If the turning check result is equal to or greater than the turning check result that the good cleric scored when turning the undead, then the undead are no longer turned. The evil cleric rolls turning damage of 2d6 + cleric level + Charisma modifier to see how many Hit Dice worth of undead he can affect in this way (as if he were rebuking them).</p>\n<h3 id=\"bolsteringUndead\">Bolstering Undead</h3>\n<p>An evil&nbsp;cleric&nbsp;may also bolster&nbsp;undead&nbsp;creatures against turning in advance. He makes a turning check as if attempting to rebuke the undead, but the Hit Dice result on&nbsp;Table: Turning Undead&nbsp;becomes the undead creatures&rsquo; effective Hit Dice as far as turning is concerned (provided the result is higher than the creatures&rsquo; actual Hit Dice). The bolstering lasts 10 rounds. An evil undead cleric can bolster himself in this manner.</p>\n<h2 id=\"neutralClericsandUndead\">Neutral Clerics and Undead</h2>\n<p>A&nbsp;cleric&nbsp;of neutral&nbsp;alignment&nbsp;can either turn undead but not rebuke them, or rebuke undead but not turn them. See&nbsp;Turn or Rebuke Undead&nbsp;for more information.</p>\n<p>Even if a cleric is neutral, channeling positive energy is a good act and channeling negative energy is evil.</p>\n<h2 id=\"paladinsandUndead\">Paladins and Undead</h2>\n<p>Beginning at 4th level,&nbsp;paladins&nbsp;can turn undead as if they were&nbsp;clerics&nbsp;of three levels lower than they actually are.</p>",
	"folder": "",
	"name": "Turn or Rebuke Undead",
	"pages": [
	],
	"permission": {
		"VIfT2pClvTXfstmc": 3,
		"default": 0
	}
}
